In [4]:
import pandas as pd
#Create and Array Data Structure
"""
i. January -2200
ii. Feburary - 2350
iii. March -2600
iv. April- 2130
v. May- 2190
"""

'\ni. January -2200\nii. Feburary - 2350\niii. March -2600\niv. April- 2130\nv. May- 2190\n'

In [29]:
Monthly_expenses= [
    {
    'Month':'January','Expense':2200
    },
    {
    'Month':'Feburary','Expense':2350
    },
    {
    'Month':'March','Expense':2600
    },
    {
    'Month':'April','Expense':2130
    },
    {
    'Month':'May','Expense':2190
    },
]

In [30]:
df=pd.DataFrame(Monthly_expenses)
df

      Month  Expense
0   January     2200
1  Feburary     2350
2     March     2600
3     April     2130
4       May     2190

In [32]:
Extra_expensesinFeburary=df.iloc[1,1]-df.iloc[0,1]
Extra_expensesinFeburary

150

In [33]:
df['Expense_previous_lookup']=df['Expense'].shift(periods=1)
df.fillna(0)

      Month  Expense  Expense_previous_lookup
0   January     2200                      0.0
1  Feburary     2350                   2200.0
2     March     2600                   2350.0
3     April     2130                   2600.0
4       May     2190                   2130.0

In [35]:
df['previousMonth_diff']=df['Expense']-df['Expense_previous_lookup']
df

      Month  Expense  Expense_previous_lookup  previousMonth_diff
0   January     2200                      NaN                 NaN
1  Feburary     2350                   2200.0               150.0
2     March     2600                   2350.0               250.0
3     April     2130                   2600.0              -470.0
4       May     2190                   2130.0                60.0

In [39]:
import numpy  as np
df['Yr Qtr']=np.where(df['Month'] in ('January','Februray','March'),'1st Quater', 
               np.where(df['Month'] in ('April','May','March'),'2nd Quater','No Value')      
                  )

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().